'''
古代航海人为了方便在航海时辨别方位和观测天象，将散布在天上的星星运用想象力将它们连接起来，有一半是在古时候已命名，另一半是近代开始命名的。两千多年前古希腊的天文学家希巴克斯命名十二星座，依次为白羊座、金牛座、双子座、巨蟹座、狮子座、处女座、天秤座、天蝎座、射手座、魔蝎座、水瓶座和双鱼座。给出二维数据存储 CSV 文件（SunSign.csv），内容如下：
星座,开始月日,结束月日,Unicode
水瓶座,120,218,9810
双鱼座,219,320,9811
白羊座,321,419,9800
金牛座,420,520,9801
双子座,521,621,9802
巨蟹座,622,722,9803
狮子座,723,822,9804
处女座,823,922,9805
天秤座,923,1023,9806
天蝎座,1024,1122,9807
射手座,1123,1221,9808
魔蝎座,1222,119,9809
请编写程序，读入 CSV 文件中数据，循环获得用户输入，直至用户输入 "exit" 退出。根据用户输入的星座名称，输出此星座的出生日期范围及对应字符形式。如果输入的星座名称有误，请输出“输入星座名称有误！”。
'''
f = open("SunSign.csv", 'r', encoding = "UTF-8")
logo = {'水瓶座':'♒','双鱼座':'♓','白羊座':'♈','金牛座':'♉','双子座':'♊','巨蟹座':'♋','狮子座':'♌','处女座':'♍','天秤座':'♎','天蝎座':'♏','射手座':'♐','魔蝎座':'♑'}
star = {}
for i in f:
    line = i.split(',')
    star[line[0]] = line[1:3]
col = set(star.keys())
str = input()
data = []
while str != 'exit':
    data.append(str)
    str = input()
for i in data:
    if i not in col:
        print("输入星座名称有误！")
    else:
        print(logo[i] + "座的生日位于" + star[i][0] + '-' + star[i][1] + '之间')
